
export interface Blogs{

  id: number,
  title: string,
  image: string,
  body: string,
  created_at: number

}

export class blogsApi {

  public static blogs : Blogs[] = [

    {
      id: 1,
      title: 'شایعه: مدل جدید پلی استیشن 5 در سال ۲۰۲۳ منتشر خواهد شد\n',
      image: 'https://pspro.ir/mag/image/cache/catalog/Mag/0445/Slide/12/ps5wwww-480x270.jpg',
      body:'<p>طبق یک گزارش جدید، به نظر می‌رسد که کمپانی سونی در حال برنامه ریزی برای انتشار نسخه‌ای جدید از کنسول پلی‌ استیشن 5 است. طبق گزارشات تام هندرسون (Tom Henderson) در سال ۲۰۲۳ می‌توانیم شاهد طراحی جدید کنسول پلی استیشن 5 با یک شاسی جدید باشیم. </p>>',
      created_at: Date.now()
    },
    {
      id: 2,
      title: 'اپل با تغییر در روند گوشی‌های آیفون ۱۴ ریسک بزرگی کرد؟\n',
      image: 'https://pspro.ir/mag/image/cache/catalog/Mag/0445/Slide/13/iphone-14-rep-480x270.jpg',
      body:'<p>طبق بازه انتشاری که اپل برای آیفون ۱۴ خود در نظر گرفته است، شما زودتر از همیشه می‌توانید آیفون‌های امسال را خریداری کنید. به جای تاریخ سنتی اپل در هفته دوم سپتامبر، همان‌طور که مارک گورمن هم پیش بینی کرده بود، اپل گوشی‌های جدید را در تاریخ ۷ سپتامبر رونمایی کرد. این تنها چیزی نیست که در مورد معرفی گوشی‌های امسال متفاوت دیده می‌شود. شایعات قبل از معرفی هم می‌گفتند که اپل با تقسیم بی سابقه‌ای مدل‌های پرو و غیر پرو و تاکید بیشتری روی ویژگی‌های سطح بالا، ترکیب آیفون ۱۴ را مانند گذشته متمایز خواهد کرد و استراتژی جدیدی را دیدیم که در خرید آیفون 14 می‌تواند یک ریسک بزرگ باشد.</p>',
      created_at: Date.now()
    },
    {
      id: 3,
      title: 'بازی Tekken 8 با انتشار تریلری معرفی شد\n',
      image: 'https://pspro.ir/mag/image/cache/catalog/tekken-8-480x270.jpg',
      body:'<p>از انتشار آخرین نسخه از سری Tekken زمان تقریبا زیادی گذشته است و دقیقا وقتی که داشتیم فکر می‌کردیم فاصله بین نسخه آخر و نسخه بعدی بیش از اندازه شده، شرکت Bandai Namco دست به کار شد و بازی Tekken 8 را رسما معرفی کرد.</p>',
      created_at: Date.now()
    },
    {
      id: 4,
      title: 'سونی از برنامه PlayStation Stars رونمایی کرد\n',
      image: 'https://pspro.ir/mag/image/cache/catalog/Mag/New%20Project-37-480x270.jpg',
      body:'<p>در آخرین رویداد State of Play سونی از بازی‌های مختلفی رونمایی شد، اما در این بین از برنامه جدید سونی به‌نام Playstation Stars نیز به‌صورت رسمی پرده‌برداری شد. برنامه Playstation Stars که به‌عنوان راهی برای تعامل بازیکنان با جامعه و زیرساخت‌های خود سونی طراحی شده است، مجموعه‌ای از مزایای مختلف را برای کاربرانی که از ویژگی‌های آن استفاده می‌کنند، فراهم می‌کند که از جمله آن‌ها می‌توان به مجموعه‌‌ای از آیتم‌های دیجیتال اشاره کرد.</p>',
      created_at: Date.now()
    }

  ]

}
